app/graphql/mutations/login.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "qwerty@gmail.com"], ["LIMIT", 1]]
---
    def resolve(email:, password:)
      user = User.find_by(email: email)