app/controllers/projects_controller.rb

  def index
    @projects = Project.page(params[:page]).per(3)
---
SELECT COUNT(*) FROM "projects"