app/controllers/projects_controller.rb

  def index;
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ";m;'am"], ["description", "sa,.cvnasv"], ["created_at", "2024-01-24 09:54:36.591867"], ["updated_at", "2024-01-24 09:54:36.591867"]]

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "title" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["title", "asklvsdvsdv"], ["updated_at", "2024-01-24 09:55:25.604859"], ["id", 3]]

  def set_project
    @project = Project.find_by(id: params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]